actuatorDisk/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;


// ************************************************************************* //

x0 0.0;
x1 102.50;
x3 205.0;

y0 -41.0;
y1 41.0;

z0 -41.0;
z1 41.0;

vertices
(
	( $x0 $y0 $z0 )
	( $x1 $y0 $z0 )
	( $x1 $y1 $z0 )
	( $x0 $y1 $z0 )
	( $x0 $y0 $z1 )
	( $x1 $y0 $z1 )
	( $x1 $y1 $z1 )
	( $x0 $y1 $z1 )
	( $x3 $y0 $z0 )
	( $x3 $y1 $z0 )
	( $x3 $y0 $z1 )
	( $x3 $y1 $z1 )
); 

blocks 
(
	hex ( 0 1 2 3 4 5 6 7 ) ( 80 64 64 ) simpleGrading ( 0.1 1 1 )
	hex ( 1 8 9 2 5 10 11 6 ) ( 80 64 64 ) simpleGrading ( 10 1 1 )
);

patches
(
	patch inlet
	(
		( 0 4 7 3 )
	)

	patch outlet
	(
		( 9 11 10 8 )
	)

	patch walls
	(
		( 0 1 2 3 )
		( 1 8 9 2 )
		( 0 1 5 4 )
		( 1 8 10 5 )
		( 4 5 6 7 )
		( 5 10 11 6 )
		( 3 7 6 2 )
		( 2 6 11 9 )
	)
);

mergePatchPairs
(
);
